backend/load-test.yml
# Artillery Load Testing Configuration
# Constitutional Requirement: Handle 25k concurrent users
# German holiday planning season peak load simulation

config:
  target: 'http://localhost:3001'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 10
      name: "Warm-up"

    # Gradual ramp-up simulating German holiday planning season
    - duration: 300  # 5 minutes
      arrivalRate: 100
      rampTo: 1000
      name: "Morning traffic"

    # Peak load - German workers planning during lunch break
    - duration: 600  # 10 minutes
      arrivalRate: 1000
      rampTo: 2500
      name: "Lunch break peak"

    # Constitutional requirement test - 25k concurrent users
    - duration: 180  # 3 minutes
      arrivalRate: 2500
      name: "Constitutional peak load"

    # Cool-down
    - duration: 120
      arrivalRate: 2500
      rampTo: 100
      name: "Cool-down"

  payload:
    path: './tests/load/test-data.csv'
    fields:
      - state
      - vacation_days
      - email
      - language

  processor: './tests/load/scenarios.js'

scenarios:
  # Scenario 1: German user checks holidays for their state
  - name: "Holiday Lookup - Bavarian Catholic User"
    weight: 30
    flow:
      - get:
          url: "/v1/holidays?state=BY&year=2025&lang=de"
          headers:
            Accept-Language: "de-DE,de;q=0.9"
          expect:
            - statusCode: 200
            - hasProperty: "holidays"
            - contentType: json
          capture:
            - json: "$.holidays[0].name"
              as: "first_holiday_name"

  # Scenario 2: Bridge weekend calculation for optimization
  - name: "Bridge Weekend Calculation - High Efficiency User"
    weight: 25
    flow:
      - post:
          url: "/v1/bridge-weekends"
          json:
            state: "{{ state }}"
            year: 2025
            vacation_days: "{{ vacation_days }}"
            optimize_for: "efficiency"
          headers:
            Accept-Language: "{{ language === 'de' ? 'de-DE,de;q=0.9' : 'en-US,en;q=0.9' }}"
          expect:
            - statusCode: 200
            - hasProperty: "bridge_weekends"
          capture:
            - json: "$.session_id"
              as: "session_id"

  # Scenario 3: Vacation plan creation with email delivery
  - name: "Vacation Plan Creation - Email Delivery"
    weight: 20
    flow:
      - post:
          url: "/v1/vacation-plan"
          json:
            state: "{{ state }}"
            vacation_days: "{{ vacation_days }}"
            selected_bridges: [1, 3, 5]  # Typical user selects 3 bridges
            language: "{{ language }}"
          expect:
            - statusCode: 201
            - hasProperty: "plan_id"
          capture:
            - json: "$.plan_id"
              as: "plan_id"

      - post:
          url: "/v1/vacation-plan/{{ plan_id }}/email"
          json:
            email: "{{ email }}"
            gdpr_consent: true
            privacy_notice_version: "1.0"
            marketing_consent: false
          expect:
            - statusCode: 200
            - hasProperty: "email_sent"

  # Scenario 4: Calendar export download (simulates email link clicks)
  - name: "Calendar Export Download"
    weight: 15
    flow:
      - get:
          url: "/v1/export/{{ $randomString() }}?signed={{ $randomString() }}"
          expect:
            - statusCode: [200, 404]  # 404 expected for invalid IDs

  # Scenario 5: Health check and monitoring
  - name: "Health Check - Monitoring"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"
            - match: "ok"

# Performance assertions based on constitutional requirements
ensure:
  # API response time requirement
  p95: 200  # 95th percentile under 200ms
  p99: 500  # 99th percentile under 500ms

  # Email delivery performance
  maxErrorRate: 0.5  # Less than 0.5% errors

  # Memory and CPU usage limits
  # These are monitored externally via APM tools

plugins:
  expect: {}
  metrics-by-endpoint:
    useOnlyRequestNames: true

# German-specific load patterns
environments:
  # Simulation of German holiday planning season (December-January)
  peak_season:
    phases:
      - duration: 300
        arrivalRate: 500
        rampTo: 2500
        name: "December holiday planning"
      - duration: 900  # 15 minutes
        arrivalRate: 2500
        name: "New Year planning peak"
      - duration: 300
        arrivalRate: 2500
        rampTo: 500
        name: "Planning wind-down"

  # Normal usage patterns
  regular:
    phases:
      - duration: 600
        arrivalRate: 100
        rampTo: 500
        name: "Regular usage"

  # Stress test - beyond constitutional requirements
  stress:
    phases:
      - duration: 180
        arrivalRate: 3000
        name: "Stress test - 3k RPS"